import random
'''
    [경마]
        horse_race리스트는 경마 게임을 표현한 것이다. 
        숫자 1~5는 말 번호를 뜻한다.               
        한 번에 말들은 2~5칸을 랜덤으로 이동한다.
        모든 말이 도착할 때까지 말의 이동 경로를 출력하시오.     
        rank리스트에 등수를 저장하시오.
    [예시]
        주사위 : [2,4,2,1,3] 이나왔다고하면, 아래와 같이 된다. 
    
        [0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        [0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        [0,0,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        [0,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        [0,0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
'''
race = [
    [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
]
rank = [0,0,0,0,0]

position = [
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
]
total = [0, 0, 0, 0, 0]

for i in range(len(race)):
    print(race[i])
print()
chk = True

while chk:
    for i in range(len(race)):
        r = random.randint(2, 5)
        # 현재위치 체크
        k = 0
        for j in range(len(race[i])):
            if i+1 == race[i][j]:
                k = j
        
        race[i][k] = 0
        if k + r >= len(race[i]):
            race[i][len(race[i])-1] = i+1
            chk = False
            break
        if chk:    
            race[i][k + r] = i+1
    for i in range(len(race)):
        print(race[i])
    print()

# 등수체크
posArr = []
for i in range(len(race)):
    for j in range(len(race[i])):
        if race[i][j] != 0:
            posArr.append(j)
print(posArr)

rank = []
for i in posArr:
    cnt = 1
    for j in posArr:
        if i < j:
            cnt += 1
    rank.append(cnt)
print(rank)